       01  BOOKS.
           05  BOOK.
               10  BNAME           PIC X(25).
               10  BEMAIL          PIC X(25).
               10  BTITLE          PIC X(25).
               10  BAUTH           PIC X(25).
               10  BBORROWEDDATE   PIC X(10).